{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":13,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense49","trainable":true,"batch_input_shape":[null,13],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"dropout_Dropout6","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense50","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense51","trainable":true}}],"keras_version":"tfjs-layers 0.7.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./my-model-1.weights.bin"],"weights":[{"name":"dense_Dense49/kernel","shape":[13,13],"dtype":"float32"},{"name":"dense_Dense49/bias","shape":[13],"dtype":"float32"},{"name":"dense_Dense50/kernel","shape":[13,5],"dtype":"float32"},{"name":"dense_Dense50/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense51/kernel","shape":[5,1],"dtype":"float32"},{"name":"dense_Dense51/bias","shape":[1],"dtype":"float32"}]}]}